/* -------------------------------------------------------------------------- */
/*                                    Tween                                   */
/* -------------------------------------------------------------------------- */
gsap.to(".tween", {
  x: 200,
  duration: 2,
  backgroundColor: "orange",
  // width: "30%",
  // height: 100,
  color: "white",
  rotation: 360,
});

/* -------------------------------------------------------------------------- */
/*                               Delay & Repeat                               */
/* -------------------------------------------------------------------------- */

//
gsap.to(".delay", {
  x: 100,
  duration: 2,
  delay: 1, // 초기시작에만 딜레이
  repeat: -1, // 무한
  yoyo: true, // 왔다갔다
  // repeatDelay:1, // 반복 마다 딜레이.
});

/* -------------------------------------------------------------------------- */
/*                                    Ease                                    */
/* -------------------------------------------------------------------------- */
// 천천히 시작했다가 천천히 멈춤 //
gsap.from(".ease", {
  opacity: 0,
  x: 400,
  duration: 2,
  ease: "power3.inOut",
});

/* -------------------------------------------------------------------------- */
/*                                   Stagger                                  */
/* -------------------------------------------------------------------------- */

const timeline = gsap.timeline();

timeline.from(".stagger li", {
  y: 80,
  opacity: 0,
  duration: 1,
  // stagger: 0.2, // 축약표현, 기본이 each
  stagger: {
    each: 0.2, // 각각시간
    // amount: 2, // 총시간 (이안에서  1/n) , each 랑 같이 못쓰고 어마운트는 이렇게써야함
    from: "center", // 나오게하는 순서 정할 수 있음
    // from: 1, // 번호
  },
  ease: "back(3)",
});
//  끝나고 재생가능
timeline.to(".stagger li ", {
  x: 100,
  rotation: 360,
  duration: 1,
  stagger: {
    each: 0.4,
    from: "end",
  },
});
/* -------------------------------------------------------------------------- */
/*                                  From의 문제점                              */
/* -------------------------------------------------------------------------- */

const box = document.querySelector(".box");

// box.addEventListener("mouseenter", () => {
//   gsap.from(".box", {
//     duration: 2,
//     rotation: 360,
//   });
// });
// 마우스 계속 들락날락 시키면 안됨. 이벤트 누적되서 멈추고 안됨 fromTo로 하시라

box.addEventListener("mouseenter", () => {
  gsap.fromTo(
    ".box",
    {
      rotation: 0,
    },
    {
      duration: 2,
      rotation: 360,
    }
  );
});
